0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3U1x6.svd
				<register>
					<name>XBAR1</name>
					<description>Crossbar 1 Control</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSG0EN</name>
							<description>SSG0 Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NONE</name>
									<description>Disable all SSG0 channels on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EX0</name>
									<description>Enable SSG0 EX0 on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EX0_1</name>
									<description>Enable SSG0 EX0 and EX1 on Crossbar 1.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EX0_3</name>
									<description>Enable SSG0 EX0, EX1, EX2, and EX3 on Crossbar 1.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP0SEN</name>
							<description>Comparator 0 Synchronous Output (CMP0S) Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 0 Synchronous Output (CMP0S) on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 0 Synchronous Output (CMP0S) on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CMP1SEN</name>
							<description>Comparator 1 Synchronous Output (CMP1S) Enable. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Comparator 1 Synchronous Output (CMP1S) on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Comparator 1 Synchronous Output (CMP1S) on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1EN</name>
							<description>SPI1 Enable. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI1 SCK, MISO, and MOSI on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI1 SCK, MISO, and MOSI on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI1NSSEN</name>
							<description>SPI1 NSS Pin Enable. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI1 NSS on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI1 NSS on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC0EN</name>
							<description>RTC0 Output Enable. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable RTC0 Output on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable RTC0 Output on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI2EN</name>
							<description>SPI2 Enable. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI2 SCK, MISO, and MOSI on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI2 SCK, MISO, and MOSI on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SPI2NSSEN</name>
							<description>SPI2 NSS Pin Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable SPI2 NSS on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable SPI2 NSS on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART1EN</name>
							<description>USART1 Enable. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART1 RX and TX on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART1 RX and TX on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART1FCEN</name>
							<description>USART1 Flow Control Enable. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART1 flow control on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART1 flow control on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USART1CEN</name>
							<description>USART1 Clock Signal Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable USART1 clock on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable USART1 clock on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UART0EN</name>
							<description>UART0 Enable. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable UART0 RX and TX on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable UART0 RX and TX on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UART0FCEN</name>
							<description>UART0 Flow Control Enable. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable UART0 flow control on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable UART0 flow control on Crossbar1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2S0TXEN</name>
							<description>I2S0 TX Enable. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2S0 TX on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2S0 TX on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2C0EN</name>
							<description>I2C0 Enable. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2C0 SDA and SCL on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2C0 SDA and SCL on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UART1EN</name>
							<description>UART1 Enable. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable UART1 RX and TX on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable UART1 RX and TX on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2S0RXEN</name>
							<description>I2S0 RX Enable. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2S0 RX on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2S0 RX on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPT0OEN</name>
							<description>LPTIMER0 Output Enable. </description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable LPTIMER0 Output on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable LPTIMER0 Output on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>I2C1EN</name>
							<description>I2C1 Enable. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable I2C1 SDA and SCL on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable I2C1 SDA and SCL on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>KILLHDEN</name>
							<description>High Drive Kill Pin Enable. </description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the PB High Drive Kill Pin on Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the PB High Drive Kill Pin on Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XBAR1EN</name>
							<description>Crossbar 1 Enable. </description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Crossbar 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable Crossbar 1.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PBKEY</name>
					<description>Global Port Key</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>KEY</name>
							<description>Port Bank 2, 3, and 4 Key. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOCKED</name>
									<description>Port Bank 2, 3, and 4 registers are locked and no valid values have been written to PBKEY.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>INTERMEDIATE</name>
									<description>Port Bank 2, 3, and 4 registers are locked and the first valid value (0xA5) has been written to PBKEY.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UNLOCKED</name>
									<description>Port Bank 2, 3, and 4 registers are unlocked. Any subsequent writes to the Port Bank 2, 3, or 4 registers or PBKEY will lock the interface.</description>
									<value>2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
