0xsmirk/mcu_cmsis_svd/SiliconLabs/SiM3_NRND/SIM3U1x6.svd
				<register>
					<name>PBSS</name>
					<description>Safe State Control</description>
					<addressOffset>0x80</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PB0SSSEL</name>
							<description>Port Bank n.0 Safe State Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HIZ</name>
									<description>Place PBn.0 in a High Impedance state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Drive PBn.0 High.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW</name>
									<description>Drive PBn.0 Low.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Ignore the safe state signal (weak pull-ups disabled).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB1SSSEL</name>
							<description>Port Bank n.1 Safe State Select. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HIZ</name>
									<description>Place PBn.1 in a High Impedance state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Drive PBn.1 High.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW</name>
									<description>Drive PBn.1 Low.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Ignore the safe state signal (weak pull-ups disabled).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB2SSSEL</name>
							<description>Port Bank n.2 Safe State Select. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HIZ</name>
									<description>Place PBn.2 in a High Impedance state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Drive PBn.2 High.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW</name>
									<description>Drive PBn.2 Low.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Ignore the safe state signal (weak pull-ups disabled).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB3SSSEL</name>
							<description>Port Bank n.3 Safe State Select. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HIZ</name>
									<description>Place PBn.3 in a High Impedance state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Drive PBn.3 High.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW</name>
									<description>Drive PBn.3 Low.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Ignore the safe state signal (weak pull-ups disabled).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB4SSSEL</name>
							<description>Port Bank n.4 Safe State Select. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HIZ</name>
									<description>Place PBn.4 in a High Impedance state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Drive PBn.4 High.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW</name>
									<description>Drive PBn.4 Low.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Ignore the safe state signal (weak pull-ups disabled).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PB5SSSEL</name>
							<description>Port Bank n.5 Safe State Select. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>HIZ</name>
									<description>Place PBn.5 in a High Impedance state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Drive PBn.5 High.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOW</name>
									<description>Drive PBn.5 Low.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Ignore the safe state signal (weak pull-ups disabled).</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSMDEN</name>
							<description>Enter Safe State Mode. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable Safe State.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enter Safe State.  Each PBn.x pin will enter the states defined by PBxSSSEL.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PBSSSMD</name>
							<description>Safe State Signal Mode. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DEGLITCH</name>
									<description>Enable deglitching on the kill signal input. The kill signal must be asserted for two APB clocks to be recognized.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IMMEDIATE</name>
									<description>Disable deglitching on the kill signal input.  The kill signal will take immediate effect.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PBLOCK</name>
					<description>Lock Control</description>
					<addressOffset>0x90</addressOffset>
					<resetValue>0x0000003F</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PBLOCK</name>
							<description>Port Bank Lock. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
